import React, { useEffect } from "react";
import Footer from "../components/Footer";
import Header from "../components/Header";

export default function UseTermsPage() {
  document.title = "Правила использования";
  useEffect(() => {
    window.scrollTo(0, 0);
  }, []);
  return (
    <>
      <Header />
      <main>
        <h3>Пользовательское Соглашение</h3>
        Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует отношения между владельцем umarketshop.site (далее юМаркет Шоп или Администрация) с одной стороны и пользователем сайта с другой.<br />
        Сайт юМаркет Шоп не является средством массовой информации.<br />
        <br />
        Используя сайт, Вы соглашаетесь с условиями данного соглашения.<br />
        <b>Если Вы не согласны с условиями данного соглашения, не используйте сайт юМаркет Шоп!</b><br />
        <br />
        <h3>Предмет соглашения</h3>
        <b>Администрация предоставляет пользователю право на размещение на сайте следующей информации:</b><br />
        <br />
        <h3>Предмет соглашения</h3>
        <b>Администрация предоставляет пользователю право на размещение на сайте следующей информации:</b><br />
        - Текстовой информации<br />
        - Фотоматериалов<br />
        - Ссылок на материалы, размещенные на других сайтах<br />
        <br />
        <h3>Права и обязанности сторон</h3>
        <b>Пользователь имеет право:</b><br />
        - осуществлять поиск информации на сайте<br />
        - получать информацию на сайте<br />
        - создавать информацию для сайта<br />
        - изменять рейтинг пользователей<br />
        - копировать информацию на другие сайты с указанием источника<br />
        - требовать от администрации скрытия любой информации о пользователе<br />
        - требовать от администрации скрытия любой информации переданной пользователем сайту<br />
        - использовать информацию сайта в личных некоммерческих целях<br />
        - использовать информацию сайта в коммерческих целях с разрешения Администрации<br />
        - использовать информацию сайта в коммерческих целях с разрешения правообладателей<br />
        - использовать информацию сайта в коммерческих целях без специального разрешения<br />
        <br />
        <b>Администрация имеет право:</b><br />
        - по своему усмотрению и необходимости создавать, изменять, отменять правила<br />
        - ограничивать доступ к любой информации на сайте<br />
        - создавать, изменять, удалять информацию<br />
        - удалять учетные записи<br />
        - отказывать в регистрации без объяснения причин<br />
        <br />
        <b>Пользователь обязуется:</b><br />
        - обеспечить достоверность предоставляемой информации<br />
        - обеспечивать сохранность личных данных от доступа третьих лиц<br />
        - обновлять Персональные данные, предоставленные при регистрации, в случае их изменения<br />
        - не копировать информацию с других источников<br />
        - при копировании информации с других источников, включать в её состав информацию об авторе<br />
        - не распространять информацию, которая направлена на пропаганду войны, разжигание национальной, расовой или религиозной ненависти и вражды, а также иной информации, за распространение которой предусмотрена уголовная или
        административная ответственность<br />
        - не нарушать работоспособность сайта<br />
        - не создавать несколько учётных записей на Сайте, если фактически они принадлежат одному и тому же лицу<br />
        - не совершать действия, направленные на введение других Пользователей в заблуждение<br />
        - не передавать в пользование свою учетную запись и/или логин и пароль своей учетной записи третьим лицам<br />
        - не регистрировать учетную запись от имени или вместо другого лица за исключением случаев, предусмотренных законодательством РФ<br />
        - не размещать материалы рекламного, эротического, порнографического или оскорбительного характера, а также иную информацию, размещение которой запрещено или противоречит нормам действующего законодательства РФ<br />
        - не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с Сайтом и его Сервисами<br />
        <br />
        <b>Администрация обязуется:</b><br />
        - поддерживать работоспособность сайта за исключением случаев, когда это невозможно по независящим от Администрации причинам.<br />
        - осуществлять разностороннюю защиту учетной записи Пользователя<br />
        - защищать информацию, распространение которой ограничено или запрещено законами путем вынесения предупреждения либо удалением учетной записи пользователя, нарушившего правила<br />
        - предоставить всю доступную информацию о Пользователе уполномоченным на то органам государственной власти в случаях, установленных законом<br />
        <br />
        <h3>Ответственность сторон</h3>
        - пользователь лично несет полную ответственность за распространяемую им информацию<br />
        - администрация не несет никакой ответственности за достоверность информации, скопированной из других источников<br />
        - администрация не несёт ответственность за несовпадение ожидаемых Пользователем и реально полученных услуг<br />
        - администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами<br />
        - в случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную работу
        информационного ресурса<br />
        <br />
        <h3>Условия действия Соглашения</h3>
        Данное Соглашение вступает в силу при любом использовании данного сайта.<br />
        Соглашение действует бессрочно.<br />
        Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему усмотрению.<br />
        При изменении соглашения, в некоторых случаях, администрация может оповестить пользователей удобным для нее способом.<br />
      </main>
      <Footer />
    </>
  );
}
